zsh.org
#+TITLE: ZSH
#+AUTHOR: Yurii Voderatskyi
#+KEYWORDS: personal dotfiles config zsh
#+PROPERTY: header-args+ :comments both
#+PROPERTY: header-args+ :tangle "~/.zshrc"

* antigen - plugin manager
   #+BEGIN_SRC sh
     case "$OSTYPE" in
         linux*)
             source /usr/share/zsh/share/antigen.zsh
             ;;
         darwin*)
             source /usr/local/share/antigen/antigen.zsh
             ;;
     esac
   #+END_SRC

* oh-my-zsh
   #+BEGIN_SRC sh
     export ZSH="${HOME}/.oh-my-zsh"
     source $ZSH/oh-my-zsh.sh
     antigen use oh-my-zsh
   #+END_SRC

* customization
  #+BEGIN_SRC sh
    # Hide username
    DEFAULT_USER=$USER

    export LANG=en_US.UTF-8

    export PATH="/usr/local/sbin:$PATH"

    #+END_SRC

* Iterm2 integration                                               :mac_only:

  #+BEGIN_SRC sh
    [ -f ~/.iterm2_shell_integration ] && source ~/.iterm2_shell_integration.zsh
    antigen bundle iterm2
  #+END_SRC

* Google Cloud SDK                                                 :mac_only:

  #+BEGIN_SRC sh
    [ -f /usr/local/Caskroom/google-cloud-sdk/latest/google-cloud-sdk/path.zsh.inc ] &&  source '/usr/local/Caskroom/google-cloud-sdk/latest/google-cloud-sdk/path.zsh.inc'
    [ -f /usr/local/Caskroom/google-cloud-sdk/latest/google-cloud-sdk/completion.zsh.inc ] && source '/usr/local/Caskroom/google-cloud-sdk/latest/google-cloud-sdk/completion.zsh.inc'
    antigen bundle gcloud
  #+END_SRC

* fzf - fuzzy finder
  #+BEGIN_SRC sh
    case "$OSTYPE" in
        linux*)
            [ -f ~/.fzf.zsh ] && source ~/.fzf.zsh
            [ -f /usr/share/fzf/key-bindings.zsh ] && source /usr/share/fzf/key-bindings.zsh
            [ -f /usr/share/fzf/completion.zsh ] && source /usr/share/fzf/completion.zsh
            ;;
    esac
  #+END_SRC

* autojump - fast navigation in filesystem
  #+BEGIN_SRC sh
    [ -f /usr/local/etc/profile.d/autojump.sh ] && source /usr/local/etc/profile.d/autojump.sh
    [ -f /etc/profile.d/autojump.sh ] && source /etc/profile.d/autojump.sh
    antigen bundle wting/autojump
  #+END_SRC

* plugins for python
  #+BEGIN_SRC sh
    antigen bundle pip
    antigen bundle django
    antigen bundle virtualenvwrapper
  #+END_SRC

* plugins misc
  #+BEGIN_SRC sh
    antigen bundle git
    antigen bundle vi-mode
    antigen bundle chrissicool/zsh-256color
    antigen bundle dotenv
    antigen bundle docker
    antigen bundle httpie
    antigen bundle zsh-users/zsh-autosuggestions
    antigen bundle zpm-zsh/colors
    antigen bundle zsh-users/zsh-syntax-highlighting
    antigen bundle common-aliases
    antigen bundle molovo/tipz
  #+END_SRC

* theme - [[https://draculatheme.com/zsh][dracula]]
  #+BEGIN_SRC sh
    antigen theme dracula/zsh
  #+END_SRC

* antigen apply changes
  #+BEGIN_SRC sh
    antigen apply
  #+END_SRC
